---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType
source: html/555907d2-578b-026a-347c-8900bcf538d8.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType

A RebarShapeDefinitionByArc takes one of three forms.

## Syntax (C#)
```csharp
public enum RebarShapeDefinitionByArcType
```